/*******************************************************Copyright*********************************************************
** 											Beijing Water-Plus Technology
**
**
**-------------------------------------------------------文件信息---------------------------------------------------------
** 文件名称:			UpRobot.h
** 最后修订日期:		2010-04-01
** 最后版本:			1.0
** 描述:				机器人控制UART通讯协议的协议栈;
**
**------------------------------------------------------------------------------------------------------------------------
** 创建人:				律晔
** 创建日期:			2010-04-01
** 版本:				1.0
** 描述:				用于生成控制结构体并写发送缓冲；
**						处理UART接收缓冲区的数据，生成状态结构体；
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
**------------------------------------------------------------------------------------------------------------------------
** 修订人:
** 修订日期:
** 版本:
** 描述:
**
*************************************************************************************************************************/
#ifndef UPROBOT_H_
#define UPROBOT_H_


#include "stm32f10x.h"
#include "Wp_UART.h"
#include "CfgTypes.h"
#include "Shell/CmdParse.h"
#include "Queue.h"
#include "Wp_Motor.h"


#define		UPROBOT_GLOBALS

#ifndef   UPROBOT_GLOBALS
     #define UPROBOT_EXT
#else 
     #define UPROBOT_EXT  extern
#endif 


/*************************************************************************************************************************
**                                                    协议相关控制字
*************************************************************************************************************************/
#define UPROBOT_START1 							0x55
#define UPROBOT_START2 							0xAA

#define BROADCAST_ID1							0xEE
#define BROADCAST_ID2							0xEF

#define UPROBOT_COMMAND_INFO_MAX_LENGTH			0x32			// 最长参数定义
#define UPROBOT_DATA_INFO_MAX_LENGTH			0x32            // 最长参数定义


/*************************************************************************************************************************
**                                                     结构体定义
*************************************************************************************************************************/
typedef struct SUprobotDataInfo
{
	u8 local_id;												// 本机ID
	u8 device_id;												// 设备ID
	u8 functional_unit;											// 功能单元代号
	u8 method_code;												// 方法代号
	u8 state_byte;												// 状态标志字
	u8 parameter_length;										// 参数长度
	u8* p_para;													// 参数数组指针，用于发送
	u8 parameter[UPROBOT_DATA_INFO_MAX_LENGTH];					// 参数数组，用于接收
}UPROBOT_DATA_INFO_STRUCT;										// UpRobot主机接收从机发送结构体


typedef struct SUprobotCommandInfo
{
	u8 local_id;												// 本机ID
	u8 device_id;												// 设备ID
	u8 functional_unit;											// 功能单元代号
	u8 method_code;												// 方法代号
	
	u8 parameter_length;										// 参数长度
	u8* p_para;													// 参数数组指针，用于接收
	u8 parameter[UPROBOT_COMMAND_INFO_MAX_LENGTH];				// 参数数组，用于接收
}UPROBOT_COMMAND_INFO_STRUCT;									// UpRobot主机发送从机接收结构体


/*************************************************************************************************************************
**                                                     结构体定义
*************************************************************************************************************************/
UPROBOT_EXT UPROBOT_COMMAND_INFO_STRUCT str_cmd;
UPROBOT_EXT UPROBOT_DATA_INFO_STRUCT str_reply;


/*************************************************************************************************************************
** 														函数外部声明
*************************************************************************************************************************/
UPROBOT_EXT void UpRobotSlaveTxPacket(UPROBOT_DATA_INFO_STRUCT* p_uprobot_send);
UPROBOT_EXT uint8_t UpRobotSlaveRxPacket(BUFFER_QUEUE* p_usart_data, UPROBOT_COMMAND_INFO_STRUCT* p_uprobot_receive);


#endif
/*************************************************************************************************************************
**														文件结束
*************************************************************************************************************************/
